## OpenTofu Plan
  ```hcl
  
#########################################################
##
##   Planning changes for dev environment...
##
#########################################################
module.teleport-agent[0].data.external.join_token: Reading...
module.observability-box[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=observability]
module.externaldns_cloudflare[0].kubernetes_cluster_role.externaldns: Refreshing state... [id=external-dns-cloudflare]
module.externaldns[0].module.namespace[0].kubernetes_namespace.this[0]: Refreshing state... [id=external-dns]
module.metallb[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=metallb-system]
module.teleport-agent[0].data.external.join_token: Read complete after 0s [id=-]
module.externaldns_cloudflare[0].kubernetes_secret.cloudflare[0]: Refreshing state... [id=external-dns/cloudflare-api-token]
module.external_secrets[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=external-secrets]
module.externaldns[0].kubernetes_deployment.externaldns[0]: Refreshing state... [id=external-dns/external-dns-pihole]
module.argocd[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=argocd]
module.externaldns_cloudflare[0].kubernetes_service_account.externaldns: Refreshing state... [id=external-dns/external-dns-cloudflare]
module.istio[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=istio-system]
module.local_path_provisioner[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=local-path-storage]
module.metrics_server[0].module.helm.helm_release.this: Refreshing state... [id=metrics-server]
module.externaldns[0].kubernetes_cluster_role.externaldns: Refreshing state... [id=external-dns-pihole]
module.externaldns_cloudflare[0].kubernetes_cluster_role_binding.externaldns: Refreshing state... [id=external-dns-cloudflare-viewer]
module.teleport-agent[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=teleport-agent]
module.externaldns[0].kubernetes_service_account.externaldns: Refreshing state... [id=external-dns/external-dns-pihole]
module.teleport-agent[0].kubernetes_cluster_role.teleport_agent: Refreshing state... [id=teleport-agent-agent]
module.teleport-agent[0].kubernetes_cluster_role.teleport_limited[0]: Refreshing state... [id=teleport-agent-limited]
module.externaldns_cloudflare[0].kubernetes_deployment.externaldns[0]: Refreshing state... [id=external-dns/external-dns-cloudflare]
module.cert_manager[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=cert-manager]
module.externaldns[0].kubernetes_cluster_role_binding.externaldns: Refreshing state... [id=external-dns-pihole-viewer]
module.observability-box[0].module.otel_collector_helm.helm_release.this: Refreshing state... [id=opentelemetry-collector]
module.observability-box[0].module.fluent_helm.helm_release.this: Refreshing state... [id=fluent]
module.teleport-agent[0].kubernetes_cluster_role_binding.teleport_agent: Refreshing state... [id=teleport-agent-agent]
module.metallb[0].module.helm.helm_release.this: Refreshing state... [id=metallb]
module.istio[0].module.istio_base.helm_release.this: Refreshing state... [id=istio-base]
module.external_secrets[0].module.vault_token_secret.kubernetes_secret.this[0]: Refreshing state... [id=external-secrets/vault-token]
module.external_secrets[0].module.helm.helm_release.this: Refreshing state... [id=external-secrets]
module.local_path_provisioner[0].module.helm.helm_release.this: Refreshing state... [id=local-path-provisioner]
module.teleport-agent[0].module.helm.helm_release.this: Refreshing state... [id=teleport-agent]
module.observability-box[0].module.prometheus_helm.helm_release.this: Refreshing state... [id=prometheus]
module.argocd[0].module.argo_rollouts_helm.helm_release.this: Refreshing state... [id=argo-rollouts]
module.cert_manager[0].module.cloudflare_secret[0].kubernetes_secret.this[0]: Refreshing state... [id=cert-manager/cloudflare-api-token]
module.cert_manager[0].module.helm.helm_release.this: Refreshing state... [id=cert-manager]
module.metallb[0].kubectl_manifest.ip_address_pool[0]: Refreshing state... [id=/apis/metallb.io/v1beta1/namespaces/metallb-system/ipaddresspools/default-pool]
module.metallb[0].kubectl_manifest.l2_advertisement[0]: Refreshing state... [id=/apis/metallb.io/v1beta1/namespaces/metallb-system/l2advertisements/default-l2]
module.istio[0].module.istiod.helm_release.this: Refreshing state... [id=istiod]
module.istio[0].kubernetes_manifest.default_certificate[0]: Refreshing state...
module.external_secrets[0].kubernetes_manifest.vault_secret_store[0]: Refreshing state...
module.external_secrets[0].kubernetes_manifest.cluster_secrets[0]: Refreshing state...
module.cert_manager[0].kubernetes_manifest.letsencrypt_issuer[0]: Refreshing state...
module.istio[0].module.istio_ingress.helm_release.this: Refreshing state... [id=istio-ingressgateway]
module.istio[0].kubernetes_manifest.default_gateway[0]: Refreshing state...

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

OpenTofu will perform the following actions:

  # module.cert_manager[0].kubernetes_manifest.letsencrypt_issuer[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "kubernetes_manifest" "letsencrypt_issuer" {
      - manifest = {
          - apiVersion = "cert-manager.io/v1"
          - kind       = "ClusterIssuer"
          - metadata   = {
              - name = "letsencrypt-prod"
            }
          - spec       = {
              - acme = {
                  - email               = "pedropilla@gmail.com"
                  - privateKeySecretRef = {
                      - name = "letsencrypt-prod"
                    }
                  - server              = "https://acme-v02.api.letsencrypt.org/directory"
                  - solvers             = [
                      - {
                          - dns01 = {
                              - cloudflare = {
                                  - apiTokenSecretRef = {
                                      - key  = "api-token"
                                      - name = "cloudflare-api-token"
                                    }
                                  - email             = "pedropilla@gmail.com"
                                }
                            }
                        },
                    ]
                }
            }
        } -> null
      - object   = {
          - apiVersion = "cert-manager.io/v1"
          - kind       = "ClusterIssuer"
          - metadata   = {
              - annotations                = null
              - creationTimestamp          = null
              - deletionGracePeriodSeconds = null
              - deletionTimestamp          = null
              - finalizers                 = null
              - generateName               = null
              - generation                 = null
              - labels                     = null
              - managedFields              = null
              - name                       = "letsencrypt-prod"
              - namespace                  = null
              - ownerReferences            = null
              - resourceVersion            = null
              - selfLink                   = null
              - uid                        = null
            }
          - spec       = {
              - acme       = {
                  - caBundle                    = null
                  - disableAccountKeyGeneration = null
                  - email                       = "pedropilla@gmail.com"
                  - enableDurationFeature       = null
                  - externalAccountBinding      = {
                      - keyAlgorithm = null
                      - keyID        = null
                      - keySecretRef = {
                          - key  = null
                          - name = null
                        }
                    }
                  - preferredChain              = null
                  - privateKeySecretRef         = {
                      - key  = null
                      - name = "letsencrypt-prod"
                    }
                  - server                      = "https://acme-v02.api.letsencrypt.org/directory"
                  - skipTLSVerify               = null
                  - solvers                     = [
                      - {
                          - dns01    = {
                              - acmeDNS       = {
                                  - accountSecretRef = {
                                      - key  = null
                                      - name = null
                                    }
                                  - host             = null
                                }
                              - akamai        = {
                                  - accessTokenSecretRef  = {
                                      - key  = null
                                      - name = null
                                    }
                                  - clientSecretSecretRef = {
                                      - key  = null
                                      - name = null
                                    }
                                  - clientTokenSecretRef  = {
                                      - key  = null
                                      - name = null
                                    }
                                  - serviceConsumerDomain = null
                                }
                              - azureDNS      = {
                                  - clientID              = null
                                  - clientSecretSecretRef = {
                                      - key  = null
                                      - name = null
                                    }
                                  - environment           = null
                                  - hostedZoneName        = null
                                  - managedIdentity       = {
                                      - clientID   = null
                                      - resourceID = null
                                    }
                                  - resourceGroupName     = null
                                  - subscriptionID        = null
                                  - tenantID              = null
                                }
                              - cloudDNS      = {
                                  - hostedZoneName          = null
                                  - project                 = null
                                  - serviceAccountSecretRef = {
                                      - key  = null
                                      - name = null
                                    }
                                }
                              - cloudflare    = {
                                  - apiKeySecretRef   = {
                                      - key  = null
                                      - name = null
                                    }
                                  - apiTokenSecretRef = {
                                      - key  = "api-token"
                                      - name = "cloudflare-api-token"
                                    }
                                  - email             = "pedropilla@gmail.com"
                                }
                              - cnameStrategy = null
                              - digitalocean  = {
                                  - tokenSecretRef = {
                                      - key  = null
                                      - name = null
                                    }
                                }
                              - rfc2136       = {
                                  - nameserver          = null
                                  - tsigAlgorithm       = null
                                  - tsigKeyName         = null
                                  - tsigSecretSecretRef = {
                                      - key  = null
                                      - name = null
                                    }
                                }
                              - route53       = {
                                  - accessKeyID              = null
                                  - accessKeyIDSecretRef     = {
                                      - key  = null
                                      - name = null
                                    }
                                  - auth                     = {
                                      - kubernetes = {
                                          - serviceAccountRef = {
                                              - audiences = null
                                              - name      = null
                                            }
                                        }
                                    }
                                  - hostedZoneID             = null
                                  - region                   = null
                                  - role                     = null
                                  - secretAccessKeySecretRef = {
                                      - key  = null
                                      - name = null
                                    }
                                }
                              - webhook       = {
                                  - config     = null
                                  - groupName  = null
                                  - solverName = null
                                }
                            }
                          - http01   = {
                              - gatewayHTTPRoute = {
                                  - labels      = null
                                  - parentRefs  = null
                                  - podTemplate = {
                                      - metadata = {
                                          - annotations = null
                                          - labels      = null
                                        }
                                      - spec     = {
                                          - affinity           = {
                                              - nodeAffinity    = {
                                                  - preferredDuringSchedulingIgnoredDuringExecution = null
                                                  - requiredDuringSchedulingIgnoredDuringExecution  = {
                                                      - nodeSelectorTerms = null
                                                    }
                                                }
                                              - podAffinity     = {
                                                  - preferredDuringSchedulingIgnoredDuringExecution = null
                                                  - requiredDuringSchedulingIgnoredDuringExecution  = null
                                                }
                                              - podAntiAffinity = {
                                                  - preferredDuringSchedulingIgnoredDuringExecution = null
                                                  - requiredDuringSchedulingIgnoredDuringExecution  = null
                                                }
                                            }
                                          - imagePullSecrets   = null
                                          - nodeSelector       = null
                                          - priorityClassName  = null
                                          - securityContext    = {
                                              - fsGroup             = null
                                              - fsGroupChangePolicy = null
                                              - runAsGroup          = null
                                              - runAsNonRoot        = null
                                              - runAsUser           = null
                                              - seLinuxOptions      = {
                                                  - level = null
                                                  - role  = null
                                                  - type  = null
                                                  - user  = null
                                                }
                                              - seccompProfile      = {
                                                  - localhostProfile = null
                                                  - type             = null
                                                }
                                              - supplementalGroups  = null
                                              - sysctls             = null
                                            }
                                          - serviceAccountName = null
                                          - tolerations        = null
                                        }
                                    }
                                  - serviceType = null
                                }
                              - ingress          = {
                                  - class            = null
                                  - ingressClassName = null
                                  - ingressTemplate  = {
                                      - metadata = {
                                          - annotations = null
                                          - labels      = null
                                        }
                                    }
                                  - name             = null
                                  - podTemplate      = {
                                      - metadata = {
                                          - annotations = null
                                          - labels      = null
                                        }
                                      - spec     = {
                                          - affinity           = {
                                              - nodeAffinity    = {
                                                  - preferredDuringSchedulingIgnoredDuringExecution = null
                                                  - requiredDuringSchedulingIgnoredDuringExecution  = {
                                                      - nodeSelectorTerms = null
                                                    }
                                                }
                                              - podAffinity     = {
                                                  - preferredDuringSchedulingIgnoredDuringExecution = null
                                                  - requiredDuringSchedulingIgnoredDuringExecution  = null
                                                }
                                              - podAntiAffinity = {
                                                  - preferredDuringSchedulingIgnoredDuringExecution = null
                                                  - requiredDuringSchedulingIgnoredDuringExecution  = null
                                                }
                                            }
                                          - imagePullSecrets   = null
                                          - nodeSelector       = null
                                          - priorityClassName  = null
                                          - securityContext    = {
                                              - fsGroup             = null
                                              - fsGroupChangePolicy = null
                                              - runAsGroup          = null
                                              - runAsNonRoot        = null
                                              - runAsUser           = null
                                              - seLinuxOptions      = {
                                                  - level = null
                                                  - role  = null
                                                  - type  = null
                                                  - user  = null
                                                }
                                              - seccompProfile      = {
                                                  - localhostProfile = null
                                                  - type             = null
                                                }
                                              - supplementalGroups  = null
                                              - sysctls             = null
                                            }
                                          - serviceAccountName = null
                                          - tolerations        = null
                                        }
                                    }
                                  - serviceType      = null
                                }
                            }
                          - selector = {
                              - dnsNames    = null
                              - dnsZones    = null
                              - matchLabels = null
                            }
                        },
                    ]
                }
              - ca         = {
                  - crlDistributionPoints  = null
                  - issuingCertificateURLs = null
                  - ocspServers            = null
                  - secretName             = null
                }
              - selfSigned = {
                  - crlDistributionPoints = null
                }
              - vault      = {
                  - auth                = {
                      - appRole           = {
                          - path      = null
                          - roleId    = null
                          - secretRef = {
                              - key  = null
                              - name = null
                            }
                        }
                      - clientCertificate = {
                          - mountPath  = null
                          - name       = null
                          - secretName = null
                        }
                      - kubernetes        = {
                          - mountPath         = null
                          - role              = null
                          - secretRef         = {
                              - key  = null
                              - name = null
                            }
                          - serviceAccountRef = {
                              - audiences = null
                              - name      = null
                            }
                        }
                      - tokenSecretRef    = {
                          - key  = null
                          - name = null
                        }
                    }
                  - caBundle            = null
                  - caBundleSecretRef   = {
                      - key  = null
                      - name = null
                    }
                  - clientCertSecretRef = {
                      - key  = null
                      - name = null
                    }
                  - clientKeySecretRef  = {
                      - key  = null
                      - name = null
                    }
                  - namespace           = null
                  - path                = null
                  - server              = null
                }
              - venafi     = {
                  - cloud = {
                      - apiTokenSecretRef = {
                          - key  = null
                          - name = null
                        }
                      - url               = null
                    }
                  - tpp   = {
                      - caBundle          = null
                      - caBundleSecretRef = {
                          - key  = null
                          - name = null
                        }
                      - credentialsRef    = {
                          - name = null
                        }
                      - url               = null
                    }
                  - zone  = null
                }
            }
        } -> null
    }

  # module.cert_manager[0].kubernetes_manifest.selfsigned_issuer[0] will be created
  + resource "kubernetes_manifest" "selfsigned_issuer" {
      + manifest = {
          + apiVersion = "cert-manager.io/v1"
          + kind       = "ClusterIssuer"
          + metadata   = {
              + name = "letsencrypt-prod"
            }
          + spec       = {
              + selfSigned = {}
            }
        }
      + object   = {
          + apiVersion = "cert-manager.io/v1"
          + kind       = "ClusterIssuer"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "letsencrypt-prod"
              + namespace                  = (known after apply)
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + acme       = {
                  + caBundle                    = (known after apply)
                  + disableAccountKeyGeneration = (known after apply)
                  + email                       = (known after apply)
                  + enableDurationFeature       = (known after apply)
                  + externalAccountBinding      = {
                      + keyAlgorithm = (known after apply)
                      + keyID        = (known after apply)
                      + keySecretRef = {
                          + key  = (known after apply)
                          + name = (known after apply)
                        }
                    }
                  + preferredChain              = (known after apply)
                  + privateKeySecretRef         = {
                      + key  = (known after apply)
                      + name = (known after apply)
                    }
                  + server                      = (known after apply)
                  + skipTLSVerify               = (known after apply)
                  + solvers                     = (known after apply)
                }
              + ca         = {
                  + crlDistributionPoints  = (known after apply)
                  + issuingCertificateURLs = (known after apply)
                  + ocspServers            = (known after apply)
                  + secretName             = (known after apply)
                }
              + selfSigned = {
                  + crlDistributionPoints = (known after apply)
                }
              + vault      = {
                  + auth                = {
                      + appRole           = {
                          + path      = (known after apply)
                          + roleId    = (known after apply)
                          + secretRef = {
                              + key  = (known after apply)
                              + name = (known after apply)
                            }
                        }
                      + clientCertificate = {
                          + mountPath  = (known after apply)
                          + name       = (known after apply)
                          + secretName = (known after apply)
                        }
                      + kubernetes        = {
                          + mountPath         = (known after apply)
                          + role              = (known after apply)
                          + secretRef         = {
                              + key  = (known after apply)
                              + name = (known after apply)
                            }
                          + serviceAccountRef = {
                              + audiences = (known after apply)
                              + name      = (known after apply)
                            }
                        }
                      + tokenSecretRef    = {
                          + key  = (known after apply)
                          + name = (known after apply)
                        }
                    }
                  + caBundle            = (known after apply)
                  + caBundleSecretRef   = {
                      + key  = (known after apply)
                      + name = (known after apply)
                    }
                  + clientCertSecretRef = {
                      + key  = (known after apply)
                      + name = (known after apply)
                    }
                  + clientKeySecretRef  = {
                      + key  = (known after apply)
                      + name = (known after apply)
                    }
                  + namespace           = (known after apply)
                  + path                = (known after apply)
                  + server              = (known after apply)
                }
              + venafi     = {
                  + cloud = {
                      + apiTokenSecretRef = {
                          + key  = (known after apply)
                          + name = (known after apply)
                        }
                      + url               = (known after apply)
                    }
                  + tpp   = {
                      + caBundle          = (known after apply)
                      + caBundleSecretRef = {
                          + key  = (known after apply)
                          + name = (known after apply)
                        }
                      + credentialsRef    = {
                          + name = (known after apply)
                        }
                      + url               = (known after apply)
                    }
                  + zone  = (known after apply)
                }
            }
        }
    }

  # module.cert_manager[0].module.cloudflare_secret[0].kubernetes_secret.this[0] will be destroyed
  # (because module.cert_manager[0].module.cloudflare_secret[0] is not in configuration)
  # (moved from module.cert_manager[0].module.cloudflare_secret.kubernetes_secret.this[0])
  - resource "kubernetes_secret" "this" {
      - binary_data_wo                 = (write-only attribute) -> null
      - data                           = (sensitive value) -> null
      - data_wo                        = (write-only attribute) -> null
      - id                             = "cert-manager/cloudflare-api-token" -> null
      - immutable                      = false -> null
      - type                           = "Opaque" -> null
      - wait_for_service_account_token = true -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "cloudflare-api-token" -> null
          - namespace        = "cert-manager" -> null
          - resource_version = "3096" -> null
          - uid              = "3f81822e-a66c-4211-849e-c6e37aa41704" -> null
        }
    }

Plan: 1 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: dev.tfplan

To perform exactly these actions, run the following command to apply:
    tofu apply "dev.tfplan"

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

OpenTofu will perform the following actions:

  # module.cert_manager[0].kubernetes_manifest.letsencrypt_issuer[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "kubernetes_manifest" "letsencrypt_issuer" {
      - manifest = {
          - apiVersion = "cert-manager.io/v1"
          - kind       = "ClusterIssuer"
          - metadata   = {
              - name = "letsencrypt-prod"
            }
          - spec       = {
              - acme = {
                  - email               = "pedropilla@gmail.com"
                  - privateKeySecretRef = {
                      - name = "letsencrypt-prod"
                    }
                  - server              = "https://acme-v02.api.letsencrypt.org/directory"
                  - solvers             = [
                      - {
                          - dns01 = {
                              - cloudflare = {
                                  - apiTokenSecretRef = {
                                      - key  = "api-token"
                                      - name = "cloudflare-api-token"
                                    }
                                  - email             = "pedropilla@gmail.com"
                                }
                            }
                        },
                    ]
                }
            }
        } -> null
      - object   = {
          - apiVersion = "cert-manager.io/v1"
          - kind       = "ClusterIssuer"
          - metadata   = {
              - annotations                = null
              - creationTimestamp          = null
              - deletionGracePeriodSeconds = null
              - deletionTimestamp          = null
              - finalizers                 = null
              - generateName               = null
              - generation                 = null
              - labels                     = null
              - managedFields              = null
              - name                       = "letsencrypt-prod"
              - namespace                  = null
              - ownerReferences            = null
              - resourceVersion            = null
              - selfLink                   = null
              - uid                        = null
            }
          - spec       = {
              - acme       = {
                  - caBundle                    = null
                  - disableAccountKeyGeneration = null
                  - email                       = "pedropilla@gmail.com"
                  - enableDurationFeature       = null
                  - externalAccountBinding      = {
                      - keyAlgorithm = null
                      - keyID        = null
                      - keySecretRef = {
                          - key  = null
                          - name = null
                        }
                    }
                  - preferredChain              = null
                  - privateKeySecretRef         = {
                      - key  = null
                      - name = "letsencrypt-prod"
                    }
                  - server                      = "https://acme-v02.api.letsencrypt.org/directory"
                  - skipTLSVerify               = null
                  - solvers                     = [
                      - {
                          - dns01    = {
                              - acmeDNS       = {
                                  - accountSecretRef = {
                                      - key  = null
                                      - name = null
                                    }
                                  - host             = null
                                }
                              - akamai        = {
                                  - accessTokenSecretRef  = {
                                      - key  = null
                                      - name = null
                                    }
                                  - clientSecretSecretRef = {
                                      - key  = null
                                      - name = null
                                    }
                                  - clientTokenSecretRef  = {
                                      - key  = null
                                      - name = null
                                    }
                                  - serviceConsumerDomain = null
                                }
                              - azureDNS      = {
                                  - clientID              = null
                                  - clientSecretSecretRef = {
                                      - key  = null
                                      - name = null
                                    }
                                  - environment           = null
                                  - hostedZoneName        = null
                                  - managedIdentity       = {
                                      - clientID   = null
                                      - resourceID = null
                                    }
                                  - resourceGroupName     = null
                                  - subscriptionID        = null
                                  - tenantID              = null
                                }
                              - cloudDNS      = {
                                  - hostedZoneName          = null
                                  - project                 = null
                                  - serviceAccountSecretRef = {
                                      - key  = null
                                      - name = null
                                    }
                                }
                              - cloudflare    = {
                                  - apiKeySecretRef   = {
                                      - key  = null
                                      - name = null
                                    }
                                  - apiTokenSecretRef = {
                                      - key  = "api-token"
                                      - name = "cloudflare-api-token"
                                    }
                                  - email             = "pedropilla@gmail.com"
                                }
                              - cnameStrategy = null
                              - digitalocean  = {
                                  - tokenSecretRef = {
                                      - key  = null
                                      - name = null
                                    }
                                }
                              - rfc2136       = {
                                  - nameserver          = null
                                  - tsigAlgorithm       = null
                                  - tsigKeyName         = null
                                  - tsigSecretSecretRef = {
                                      - key  = null
                                      - name = null
                                    }
                                }
                              - route53       = {
                                  - accessKeyID              = null
                                  - accessKeyIDSecretRef     = {
                                      - key  = null
                                      - name = null
                                    }
                                  - auth                     = {
                                      - kubernetes = {
                                          - serviceAccountRef = {
                                              - audiences = null
                                              - name      = null
                                            }
                                        }
                                    }
                                  - hostedZoneID             = null
                                  - region                   = null
                                  - role                     = null
                                  - secretAccessKeySecretRef = {
                                      - key  = null
                                      - name = null
                                    }
                                }
                              - webhook       = {
                                  - config     = null
                                  - groupName  = null
                                  - solverName = null
                                }
                            }
                          - http01   = {
                              - gatewayHTTPRoute = {
                                  - labels      = null
                                  - parentRefs  = null
                                  - podTemplate = {
                                      - metadata = {
                                          - annotations = null
                                          - labels      = null
                                        }
                                      - spec     = {
                                          - affinity           = {
                                              - nodeAffinity    = {
                                                  - preferredDuringSchedulingIgnoredDuringExecution = null
                                                  - requiredDuringSchedulingIgnoredDuringExecution  = {
                                                      - nodeSelectorTerms = null
                                                    }
                                                }
                                              - podAffinity     = {
                                                  - preferredDuringSchedulingIgnoredDuringExecution = null
                                                  - requiredDuringSchedulingIgnoredDuringExecution  = null
                                                }
                                              - podAntiAffinity = {
                                                  - preferredDuringSchedulingIgnoredDuringExecution = null
                                                  - requiredDuringSchedulingIgnoredDuringExecution  = null
                                                }
                                            }
                                          - imagePullSecrets   = null
                                          - nodeSelector       = null
                                          - priorityClassName  = null
                                          - securityContext    = {
                                              - fsGroup             = null
                                              - fsGroupChangePolicy = null
                                              - runAsGroup          = null
                                              - runAsNonRoot        = null
                                              - runAsUser           = null
                                              - seLinuxOptions      = {
                                                  - level = null
                                                  - role  = null
                                                  - type  = null
                                                  - user  = null
                                                }
                                              - seccompProfile      = {
                                                  - localhostProfile = null
                                                  - type             = null
                                                }
                                              - supplementalGroups  = null
                                              - sysctls             = null
                                            }
                                          - serviceAccountName = null
                                          - tolerations        = null
                                        }
                                    }
                                  - serviceType = null
                                }
                              - ingress          = {
                                  - class            = null
                                  - ingressClassName = null
                                  - ingressTemplate  = {
                                      - metadata = {
                                          - annotations = null
                                          - labels      = null
                                        }
                                    }
                                  - name             = null
                                  - podTemplate      = {
                                      - metadata = {
                                          - annotations = null
                                          - labels      = null
                                        }
                                      - spec     = {
                                          - affinity           = {
                                              - nodeAffinity    = {
                                                  - preferredDuringSchedulingIgnoredDuringExecution = null
                                                  - requiredDuringSchedulingIgnoredDuringExecution  = {
                                                      - nodeSelectorTerms = null
                                                    }
                                                }
                                              - podAffinity     = {
                                                  - preferredDuringSchedulingIgnoredDuringExecution = null
                                                  - requiredDuringSchedulingIgnoredDuringExecution  = null
                                                }
                                              - podAntiAffinity = {
                                                  - preferredDuringSchedulingIgnoredDuringExecution = null
                                                  - requiredDuringSchedulingIgnoredDuringExecution  = null
                                                }
                                            }
                                          - imagePullSecrets   = null
                                          - nodeSelector       = null
                                          - priorityClassName  = null
                                          - securityContext    = {
                                              - fsGroup             = null
                                              - fsGroupChangePolicy = null
                                              - runAsGroup          = null
                                              - runAsNonRoot        = null
                                              - runAsUser           = null
                                              - seLinuxOptions      = {
                                                  - level = null
                                                  - role  = null
                                                  - type  = null
                                                  - user  = null
                                                }
                                              - seccompProfile      = {
                                                  - localhostProfile = null
                                                  - type             = null
                                                }
                                              - supplementalGroups  = null
                                              - sysctls             = null
                                            }
                                          - serviceAccountName = null
                                          - tolerations        = null
                                        }
                                    }
                                  - serviceType      = null
                                }
                            }
                          - selector = {
                              - dnsNames    = null
                              - dnsZones    = null
                              - matchLabels = null
                            }
                        },
                    ]
                }
              - ca         = {
                  - crlDistributionPoints  = null
                  - issuingCertificateURLs = null
                  - ocspServers            = null
                  - secretName             = null
                }
              - selfSigned = {
                  - crlDistributionPoints = null
                }
              - vault      = {
                  - auth                = {
                      - appRole           = {
                          - path      = null
                          - roleId    = null
                          - secretRef = {
                              - key  = null
                              - name = null
                            }
                        }
                      - clientCertificate = {
                          - mountPath  = null
                          - name       = null
                          - secretName = null
                        }
                      - kubernetes        = {
                          - mountPath         = null
                          - role              = null
                          - secretRef         = {
                              - key  = null
                              - name = null
                            }
                          - serviceAccountRef = {
                              - audiences = null
                              - name      = null
                            }
                        }
                      - tokenSecretRef    = {
                          - key  = null
                          - name = null
                        }
                    }
                  - caBundle            = null
                  - caBundleSecretRef   = {
                      - key  = null
                      - name = null
                    }
                  - clientCertSecretRef = {
                      - key  = null
                      - name = null
                    }
                  - clientKeySecretRef  = {
                      - key  = null
                      - name = null
                    }
                  - namespace           = null
                  - path                = null
                  - server              = null
                }
              - venafi     = {
                  - cloud = {
                      - apiTokenSecretRef = {
                          - key  = null
                          - name = null
                        }
                      - url               = null
                    }
                  - tpp   = {
                      - caBundle          = null
                      - caBundleSecretRef = {
                          - key  = null
                          - name = null
                        }
                      - credentialsRef    = {
                          - name = null
                        }
                      - url               = null
                    }
                  - zone  = null
                }
            }
        } -> null
    }

  # module.cert_manager[0].kubernetes_manifest.selfsigned_issuer[0] will be created
  + resource "kubernetes_manifest" "selfsigned_issuer" {
      + manifest = {
          + apiVersion = "cert-manager.io/v1"
          + kind       = "ClusterIssuer"
          + metadata   = {
              + name = "letsencrypt-prod"
            }
          + spec       = {
              + selfSigned = {}
            }
        }
      + object   = {
          + apiVersion = "cert-manager.io/v1"
          + kind       = "ClusterIssuer"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "letsencrypt-prod"
              + namespace                  = (known after apply)
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + acme       = {
                  + caBundle                    = (known after apply)
                  + disableAccountKeyGeneration = (known after apply)
                  + email                       = (known after apply)
                  + enableDurationFeature       = (known after apply)
                  + externalAccountBinding      = {
                      + keyAlgorithm = (known after apply)
                      + keyID        = (known after apply)
                      + keySecretRef = {
                          + key  = (known after apply)
                          + name = (known after apply)
                        }
                    }
                  + preferredChain              = (known after apply)
                  + privateKeySecretRef         = {
                      + key  = (known after apply)
                      + name = (known after apply)
                    }
                  + server                      = (known after apply)
                  + skipTLSVerify               = (known after apply)
                  + solvers                     = (known after apply)
                }
              + ca         = {
                  + crlDistributionPoints  = (known after apply)
                  + issuingCertificateURLs = (known after apply)
                  + ocspServers            = (known after apply)
                  + secretName             = (known after apply)
                }
              + selfSigned = {
                  + crlDistributionPoints = (known after apply)
                }
              + vault      = {
                  + auth                = {
                      + appRole           = {
                          + path      = (known after apply)
                          + roleId    = (known after apply)
                          + secretRef = {
                              + key  = (known after apply)
                              + name = (known after apply)
                            }
                        }
                      + clientCertificate = {
                          + mountPath  = (known after apply)
                          + name       = (known after apply)
                          + secretName = (known after apply)
                        }
                      + kubernetes        = {
                          + mountPath         = (known after apply)
                          + role              = (known after apply)
                          + secretRef         = {
                              + key  = (known after apply)
                              + name = (known after apply)
                            }
                          + serviceAccountRef = {
                              + audiences = (known after apply)
                              + name      = (known after apply)
                            }
                        }
                      + tokenSecretRef    = {
                          + key  = (known after apply)
                          + name = (known after apply)
                        }
                    }
                  + caBundle            = (known after apply)
                  + caBundleSecretRef   = {
                      + key  = (known after apply)
                      + name = (known after apply)
                    }
                  + clientCertSecretRef = {
                      + key  = (known after apply)
                      + name = (known after apply)
                    }
                  + clientKeySecretRef  = {
                      + key  = (known after apply)
                      + name = (known after apply)
                    }
                  + namespace           = (known after apply)
                  + path                = (known after apply)
                  + server              = (known after apply)
                }
              + venafi     = {
                  + cloud = {
                      + apiTokenSecretRef = {
                          + key  = (known after apply)
                          + name = (known after apply)
                        }
                      + url               = (known after apply)
                    }
                  + tpp   = {
                      + caBundle          = (known after apply)
                      + caBundleSecretRef = {
                          + key  = (known after apply)
                          + name = (known after apply)
                        }
                      + credentialsRef    = {
                          + name = (known after apply)
                        }
                      + url               = (known after apply)
                    }
                  + zone  = (known after apply)
                }
            }
        }
    }

  # module.cert_manager[0].module.cloudflare_secret[0].kubernetes_secret.this[0] will be destroyed
  # (because module.cert_manager[0].module.cloudflare_secret[0] is not in configuration)
  # (moved from module.cert_manager[0].module.cloudflare_secret.kubernetes_secret.this[0])
  - resource "kubernetes_secret" "this" {
      - binary_data_wo                 = (write-only attribute) -> null
      - data                           = (sensitive value) -> null
      - data_wo                        = (write-only attribute) -> null
      - id                             = "cert-manager/cloudflare-api-token" -> null
      - immutable                      = false -> null
      - type                           = "Opaque" -> null
      - wait_for_service_account_token = true -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "cloudflare-api-token" -> null
          - namespace        = "cert-manager" -> null
          - resource_version = "3096" -> null
          - uid              = "3f81822e-a66c-4211-849e-c6e37aa41704" -> null
        }
    }

Plan: 1 to add, 0 to change, 2 to destroy.

#########################################################
##
##   Planning changes for prod environment...
##
#########################################################
module.metrics_server[0].module.helm.helm_release.this: Refreshing state... [id=metrics-server]
module.teleport-agent[0].data.external.join_token: Reading...
module.istio[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=istio-system]
module.externaldns_cloudflare[0].kubernetes_service_account.externaldns: Refreshing state... [id=external-dns/external-dns-cloudflare]
module.teleport-agent[0].data.external.join_token: Read complete after 0s [id=-]
module.observability-box[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=observability]
module.external_secrets[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=external-secrets]
module.externaldns[0].module.namespace[0].kubernetes_namespace.this[0]: Refreshing state... [id=external-dns]
module.metallb[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=metallb-system]
module.cert_manager[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=cert-manager]
module.argocd[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=argocd]
module.teleport-agent[0].kubernetes_cluster_role.teleport_agent: Refreshing state... [id=teleport-agent-agent]
module.local_path_provisioner[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=local-path-storage]
module.teleport-agent[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=teleport-agent]
module.externaldns_cloudflare[0].kubernetes_secret.cloudflare[0]: Refreshing state... [id=external-dns/cloudflare-api-token]
module.externaldns_cloudflare[0].kubernetes_cluster_role.externaldns: Refreshing state... [id=external-dns-cloudflare]
module.teleport-agent[0].kubernetes_cluster_role.teleport_limited[0]: Refreshing state... [id=teleport-agent-limited]
module.externaldns[0].kubernetes_cluster_role.externaldns: Refreshing state... [id=external-dns-pihole]
module.externaldns[0].kubernetes_service_account.externaldns: Refreshing state... [id=external-dns/external-dns-pihole]
module.externaldns[0].kubernetes_deployment.externaldns[0]: Refreshing state... [id=external-dns/external-dns-pihole]
module.cert_manager[0].module.cloudflare_secret[0].kubernetes_secret.this[0]: Refreshing state... [id=cert-manager/cloudflare-api-token]
module.istio[0].module.istio_base.helm_release.this: Refreshing state... [id=istio-base]
module.external_secrets[0].module.helm.helm_release.this: Refreshing state... [id=external-secrets]
module.metallb[0].module.helm.helm_release.this: Refreshing state... [id=metallb]
module.externaldns_cloudflare[0].kubernetes_cluster_role_binding.externaldns: Refreshing state... [id=external-dns-cloudflare-viewer]
module.externaldns_cloudflare[0].kubernetes_deployment.externaldns[0]: Refreshing state... [id=external-dns/external-dns-cloudflare]
module.observability-box[0].module.otel_collector_helm.helm_release.this: Refreshing state... [id=opentelemetry-collector]
module.externaldns[0].kubernetes_cluster_role_binding.externaldns: Refreshing state... [id=external-dns-pihole-viewer]
module.external_secrets[0].module.vault_token_secret.kubernetes_secret.this[0]: Refreshing state... [id=external-secrets/vault-token]
module.observability-box[0].module.fluent_helm.helm_release.this: Refreshing state... [id=fluent]
module.local_path_provisioner[0].module.helm.helm_release.this: Refreshing state... [id=local-path-provisioner]
module.cert_manager[0].module.helm.helm_release.this: Refreshing state... [id=cert-manager]
module.observability-box[0].module.prometheus_helm.helm_release.this: Refreshing state... [id=prometheus]
module.argocd[0].module.argo_rollouts_helm.helm_release.this: Refreshing state... [id=argo-rollouts]
module.teleport-agent[0].kubernetes_cluster_role_binding.teleport_agent: Refreshing state... [id=teleport-agent-agent]
module.teleport-agent[0].module.helm.helm_release.this: Refreshing state... [id=teleport-agent]
module.metallb[0].kubectl_manifest.ip_address_pool[0]: Refreshing state... [id=/apis/metallb.io/v1beta1/namespaces/metallb-system/ipaddresspools/default-pool]
module.metallb[0].kubectl_manifest.l2_advertisement[0]: Refreshing state... [id=/apis/metallb.io/v1beta1/namespaces/metallb-system/l2advertisements/default-l2]
module.istio[0].module.istiod.helm_release.this: Refreshing state... [id=istiod]
module.istio[0].kubernetes_manifest.default_certificate[0]: Refreshing state...
module.external_secrets[0].kubernetes_manifest.vault_secret_store[0]: Refreshing state...
module.cert_manager[0].kubernetes_manifest.letsencrypt_issuer[0]: Refreshing state...
module.external_secrets[0].kubernetes_manifest.cluster_secrets[0]: Refreshing state...
module.istio[0].module.istio_ingress.helm_release.this: Refreshing state... [id=istio-ingressgateway]
module.istio[0].kubernetes_manifest.default_gateway[0]: Refreshing state...

OpenTofu used the selecte

... Output truncated due to size. See artifacts for full plan.
  ```

  Plan exit code: 0
  